import psycopg2
import pandas as pd

try:
    connection = psycopg2.connect(
        host="localhost",         
        port="5435",               
        user="postgres",          
        password="student",        
        database="student_task"        
    )
    print("✓ Подключение установлено")


    query = """
    SELECT 
        pr.id AS price_id,
        p.name AS product_name,
        p.category AS product_category,
        pr.price,
        pr.created_at
    FROM prices pr
    JOIN products p ON pr.product_id = p.id
    ORDER BY pr.id;
    """

    df = pd.read_sql(query, connection)




#--------------------------задание 2------------------------------------------------------------------
    print('#--------------------------задание 2------------------------------------------------------------------')
    print(df)   
    print('------------------------------------------------------------------------------------------------------\n')
#------------------------------------------------------------------------------------------------------\n



#--------------------------задание 3------------------------------------------------------------------
    print('#--------------------------задание 3------------------------------------------------------------------')
    print('===== Статистика по ценам товаров =====')
    print(f"Средняя цена: {df['price'].mean()} руб.")
    print(f"Медиана: {df['price'].median()} руб.")
    print(f"Стандартное отклонение: {df['price'].std()} руб.")
    print(f"Минимальная цена: {df['price'].min()} руб.")
    print(f"Максимальная цена: {df['price'].max()} руб.")
    print('------------------------------------------------------------------------------------------------------\n')
#------------------------------------------------------------------------------------------------------\n







#--------------------------задание 4------------------------------------------------------------------
    print('#--------------------------задание 4------------------------------------------------------------------')
    q1 = df['price'].quantile(0.25)
    q2 = df['price'].quantile(0.50) 
    q3 = df['price'].quantile(0.75)
    
    iqr = q3 - q1

    print('\n' + '='*50)
    print(' ' * 15 + 'Расчёт квартилей и IQR' + ' ' * 15)
    print('='*50)
    print(f'Первый квартиль (Q1, 25%)      : {q1:.2f} руб.')
    print(f'Второй квартиль (Q2, Медиана)  : {q2:.2f} руб.')
    print(f'Третий квартиль (Q3, 75%)      : {q3:.2f} руб.')
    print(f'Межквартильный размах (IQR)    : {iqr:.2f} руб.')
    print('='*50)

    expensive_products = df[df['price'] > q3]

    print(f'\n=== Список товаров дороже Q3 (Всего найдено: {len(expensive_products)}) ===')
    
    premium_list = expensive_products[['product_name', 'product_category', 'price']].drop_duplicates(subset=['product_name'])
    
    print(premium_list.to_string(index=False, formatters={'price': '{:.2f} руб.'.format}))
    print('------------------------------------------------------------------------------------------------------\n')
#------------------------------------------------------------------------------------------------------\n





#--------------------------задание 5------------------------------------------------------------------
    print('#--------------------------задание 5------------------------------------------------------------------')
    cat_stat = df.groupby('product_category')['price'].agg(
        count='count',       
        mean='mean',         
        median='median',     
        std='std'           
    )

    cat_stat_sort = cat_stat.sort_values(by='mean', ascending=False)

    print("\n=================== анализ цен по категориям товаров ===================")
    
    cat_stat_sort.columns = ['Кол-во цен', 'Средняя цена', 'Медиана', 'Ст. отклонение']
    
    print(cat_stat_sort.round(2).to_string())
    print("========================================================================")

    price_range = df.groupby(['product_name', 'product_category'])['price'].agg(
        min_price='min',
        max_price='max'
    ).reset_index()
    print('------------------------------------------------------------------------------------------------------\n')
#------------------------------------------------------------------------------------------------------\n



#--------------------------задание 6------------------------------------------------------------------
    print('#--------------------------задание 6------------------------------------------------------------------')
    price_range['price_difference'] = price_range['max_price'] - price_range['min_price']

    spread = price_range.sort_values(by='price_difference', ascending=False)

    print("\n================================== Разброс цен =================================")
    
    spread.columns = ['Название товара', 'Категория', 'Мин. цена', 'Макс. цена', 'Разница (разброс)']
    
    print(spread.round(2).to_string(index=False, formatters={
        'Мин. цена': '{:.2f} руб.'.format,
        'Макс. цена': '{:.2f} руб.'.format,
        'Разница (разброс)': '{:.2f} руб.'.format
    }))
    print("==================================================================================")
    print('------------------------------------------------------------------------------------------------------\n')
#------------------------------------------------------------------------------------------------------\n


except Exception as error:
    print(f"Ошибка при подключении: {error}")
finally:
    if 'connection' in locals() and connection:
        connection.close()
        print("\n✓ Соединение с СУБД успешно закрыто.")
